---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarElemLength
source: html/b16601a0-c782-1be6-cd59-04e2558b3505.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarElemLength Property

"Bar Length"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarElemLength { get; }
```